# Libraries

In [1]:
import pandas as pd
import numpy as np
from datetime import date

# Data Import
### PALMS

In [11]:
year = 2016
month = "03"

df_palms_test = pd.read_csv(f"data/palms_report_data_{year}_{month}.csv", index_col=0, encoding="ISO-8859-1")
columns_list = df_palms_test.columns.tolist()
columns_list = columns_list[-2:] + columns_list[:-2]
df_palms_test = df_palms_test[columns_list]
df_palms_test["palms_date"] = date(year, int(month), 1)
df_palms_test.head(10)

,user_ID,chapter_ID,P,A,L,M,S,RGI,RGO,RRI,RRO,V,1-2-1,TYFCB,CEU,palms_date
0,733,1,3,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
1,1150,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
2,414,1,3,0,0,0,0,0,0,0,0,0,2,0,0,2016-03-01
3,1721,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
4,1919,1,4,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
5,631,1,3,1,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
6,2260,1,2,1,0,0,0,0,0,0,0,0,3,0,0,2016-03-01
7,313,1,2,1,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
8,1267,1,3,0,0,0,0,0,0,0,0,0,5,0,0,2016-03-01
9,1870,1,3,1,0,0,0,0,0,0,0,0,0,0,0,2016-03-01

In [10]:
start_year = 2016
start_month = 2
n_files = 60

df_palms = pd.DataFrame()

for i in range(n_files):
    month = (start_month + i) % 12 + 1
    month = str(month)
    if len(month) == 1:
        month = "0" + month
    else:
        pass
    year = start_year + ((start_month + i) // 12)
#     print(f"region-palms-report_{year}_{month}.csv")
    
    df_temp = pd.read_csv(f"data/palms_report_data_{year}_{month}.csv", index_col=0, encoding="ISO-8859-1")
    df_temp["palms_date"] = date(year, int(month), 1)

    df_palms = pd.concat([df_palms, df_temp])

column_list = df_palms.columns.tolist()
column_list = column_list[-3:-1] + column_list[:-3] + [column_list[-1]]
df_palms = df_palms[column_list]

df_palms.reset_index(inplace=True, drop=True)
df_palms

,user_ID,chapter_ID,P,A,L,M,S,RGI,RGO,RRI,RRO,V,1-2-1,TYFCB,CEU,palms_date
0,733,1,3,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
1,1150,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
2,414,1,3,0,0,0,0,0,0,0,0,0,2,0,0,2016-03-01
3,1721,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
4,1919,1,4,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29211,2875,31,4,0,0,0,0,5,4,11,7,1,1,3913,2,2021-02-01
29212,276,31,4,0,0,0,0,3,2,1,0,0,3,4214,8,2021-02-01
29213,585,31,3,1,0,0,0,8,1,2,6,0,7,73,0,2021-02-01
29214,1223,31,3,1,0,0,0,2,4,7,1,0,10,1755,4,2021-02-01
29215,2917,31,3,0,0,0,0,0,0,0,1,0,1,0,0,2021-02-01

### database

In [36]:
df_database = pd.read_csv("data/database_data.csv", index_col=0, encoding="ISO-8859-1")
column_list = df_database.columns.tolist()

# don't use "chapter_ID" column - duplicate information
column_list = column_list[-3:-2] + column_list[:-3] + [column_list[-1]]
df_database = df_database[column_list]
df_database.head(10)

,user_ID,Profession,Position,Join Date,Renewal Date,sponsor_ID
0,982,"Medical, Chiropractor",NaN,01/07/2004,01/12/2010,NaN
1,860,"Trades, Renovations-Remodeling",NaN,01/02/2008,01/12/2008,NaN
2,1970,"Food/Beverages, Chef",NaN,01/09/2010,01/12/2011,NaN
3,898,"Gifts, Gift Baskets",NaN,01/03/2007,07/04/2008,898.0
4,2204,"Mortgage, Mortgage Broker",NaN,01/07/2007,01/07/2008,NaN
5,1465,"Real estate services, Residential Real Estate ...",NaN,01/07/2007,01/04/2021,NaN
6,2377,"Insurance, Life,Health and Disability Insurance",NaN,01/07/2007,01/11/2009,NaN
7,2214,"Financial, Investment Advisor",NaN,01/07/2007,01/04/2009,NaN
8,832,"Health & Wellness, Massage Therapist",NaN,01/07/2007,01/07/2008,NaN
9,715,"Insurance, General-Motor Insurance",NaN,01/10/2007,01/10/2008,898.0

In [37]:
df_database.rename(columns={"Profession": "profession",
                            "Position": "position",
                            "Join Date": "join_date",
                            "Renewal Date": "renewal_date",}, 
                   inplace=True)


df_database["join_date"] = pd.to_datetime(df_database["join_date"], format='%d/%m/%Y', errors='coerce')
df_database["renewal_date"] = pd.to_datetime(df_database["renewal_date"], format='%d/%m/%Y', errors='coerce')
df_database.tail()

,user_ID,profession,position,join_date,renewal_date,sponsor_ID
3389,2265,"Construction, Builder/General Contractor",NaN,2021-03-01,2022-03-01,2512.0
3390,2736,"Legal & Accounting, Real Estate Law",NaN,2021-02-01,2022-02-01,NaN
3391,1827,"Construction, Electrician",NaN,2021-02-01,2022-02-01,2419.0
3392,257,"Finance & Insurance, Life,Health and Disabilit...",NaN,2021-03-01,2022-03-01,1369.0
3393,132,"Finance & Insurance, Residential Mortgages",NaN,2021-03-01,2022-03-01,NaN

### dropped_members

In [23]:
df_dropped_members = pd.read_csv("data/dropped_members_data.csv", index_col=0, encoding="ISO-8859-1")
column_list = df_dropped_members.columns.tolist()
column_list = column_list[-2:-1] + column_list[:-2]
df_dropped_members = df_dropped_members[column_list]

df_dropped_members.drop(["Date/Time"], axis=1, inplace=True)

df_dropped_members.rename(columns={"Effective Drop Date": "drop_date",
                                   "Reason": "drop_reason",
                                   "Drop Type": "drop_type"}, 
                          inplace=True)
df_dropped_members.head(10)

   user_ID   drop_date                      drop_reason drop_type
0   1936.0  11/01/2021              Takes Too Much Time  Resigned
1   1546.0  24/02/2021                 Personal Reasons  Resigned
2   1622.0  05/02/2021         Other Reason (see notes)  Resigned
3   2598.0  16/02/2021         Other Reason (see notes)  Resigned
4   2760.0  16/02/2021  Member Transferred BNI Chapters  Resigned
5   1178.0  11/02/2021         Other Reason (see notes)  Resigned
6   2699.0  09/02/2021                No Reason Entered  Resigned
7   2474.0  01/02/2021  Member Transferred BNI Chapters  Resigned
8   2462.0  31/01/2021                 Personal Reasons  Resigned
9   1479.0  01/12/2020                              NaN    System

In [24]:
df_dropped_members.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2093 entries, 0 to 2092
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_ID      2077 non-null   float64
 1   drop_date    2093 non-null   object
 2   drop_reason  1216 non-null   object
 3   drop_type    2093 non-null   object
dtypes: float64(1), object(3)
memory usage: 81.8+ KB

In [25]:
df_dropped_members[df_dropped_members["user_ID"].isna()]

      user_ID   drop_date drop_reason drop_type
1299      NaN  16/03/2015         NaN       Yes
1395      NaN  25/08/2014         NaN       Yes
1418      NaN  15/07/2014         NaN       Yes
1437      NaN  27/05/2014         NaN       Yes
1440      NaN  21/05/2014         NaN       Yes
1676      NaN  09/10/2012         NaN       Yes
1833      NaN  22/10/2011         NaN       Yes
1834      NaN  22/10/2011         NaN       Yes
1835      NaN  22/10/2011         NaN       Yes
1863      NaN  15/08/2011         NaN       Yes
1864      NaN  15/08/2011         NaN       Yes
1865      NaN  15/08/2011         NaN       Yes
1876      NaN  20/07/2011         NaN       Yes
1879      NaN  19/07/2011         NaN       Yes
1881      NaN  13/07/2011         NaN       Yes
2002      NaN  06/01/2010         NaN       Yes

Seems like there are some missing values in ```user_ID``` column. They are all, however, listed from a time period before the PALMS data that is being looked into, so those records can be dropped.

In [26]:
df_dropped_members = df_dropped_members[~df_dropped_members["user_ID"].isna()]
df_dropped_members.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2077 entries, 0 to 2092
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_ID      2077 non-null   float64
 1   drop_date    2077 non-null   object
 2   drop_reason  1216 non-null   object
 3   drop_type    2077 non-null   object
dtypes: float64(1), object(3)
memory usage: 81.1+ KB

In [27]:
df_dropped_members["drop_date"] = pd.to_datetime(df_dropped_members["drop_date"], format='%d/%m/%Y', errors='coerce')
df_dropped_members["user_ID"] = pd.to_numeric(df_dropped_members["user_ID"], downcast='integer')
df_dropped_members.head()

   user_ID  drop_date                      drop_reason drop_type
0     1936 2021-01-11              Takes Too Much Time  Resigned
1     1546 2021-02-24                 Personal Reasons  Resigned
2     1622 2021-02-05         Other Reason (see notes)  Resigned
3     2598 2021-02-16         Other Reason (see notes)  Resigned
4     2760 2021-02-16  Member Transferred BNI Chapters  Resigned

### Joined data

In [38]:
df_master = df_palms.copy()
df_master = df_master.merge(df_database, how="left", on="user_ID")
df_master = df_master.merge(df_dropped_members, how="left", on="user_ID")
df_master.sample(10, random_state=13)

,user_ID,chapter_ID,P,A,L,M,S,RGI,RGO,RRI,...,CEU,palms_date,profession,position,join_date,renewal_date,sponsor_ID,drop_date,drop_reason,drop_type
5068,1226,1,3,0,0,0,0,0,3,0,...,1,2016-10-01,"Financial, Investment Advisor",NaN,2016-04-01,2017-10-01,920.0,NaT,NaN,NaN
15797,2547,25,3,0,0,0,2,0,0,1,...,1,2017-11-01,"Real Estate, Real Estate Sales Representative ...",NaN,2014-05-01,2016-06-01,1345.0,2018-01-18,"Company related (e.g. Changed Jobs, Left Compa...",Resigned
42547,840,25,1,0,0,0,0,0,0,0,...,0,2020-09-01,"Security, Security Services","Secretary / Treasurer, Member",2020-09-01,2021-02-01,NaN,2019-10-04,Other Reason (see notes),Resigned
16824,1448,9,4,0,0,0,0,2,4,1,...,40,2018-01-01,"Information Technology, Design Web",NaN,2017-11-01,2018-11-01,NaN,2019-11-01,Did Not Renew - No reason Given,Resigned
21369,1311,30,4,0,0,0,0,0,8,0,...,7,2018-06-01,"Financial, Investment Advisor",NaN,2017-04-01,2020-04-01,922.0,2020-03-19,Other Reason (see notes),Resigned
43444,2184,5,4,0,0,0,0,5,18,3,...,4,2020-11-01,"Trades, General Contractor",NaN,2018-09-01,2019-09-01,NaN,2018-09-12,Other Reason (see notes),Terminated
26955,2911,31,4,0,0,0,1,3,3,1,...,0,2019-01-01,"Trades, Renovations - Exterior",NaN,2017-06-01,2019-06-01,2905.0,2017-04-01,NaN,System
23692,1004,30,4,0,0,0,0,4,10,1,...,4,2018-09-01,"Real estate services, Residential Real Estate ...","Membership Committee, Member",2015-12-01,2021-12-01,1985.0,NaT,NaN,NaN
535,818,24,5,0,0,0,0,3,0,2,...,0,2016-03-01,"Marketing, Digital Marketing",NaN,2015-12-01,2018-09-01,NaN,2018-05-23,Other Reason (see notes),Terminated
5404,82,16,4,0,0,0,0,3,0,0,...,11,2016-10-01,"Alternative Medicine, Nutritionist",NaN,2013-09-01,2017-09-01,2681.0,2017-04-17,Not Enough Referrals,Resigned